Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/drugs_and_medicines/herbal_medicines.html.txt.tmx
Source language: en
Languages: ga

source: In general, products that are sold as medicines or having medicinal properties in Ireland must be licensed by the Health Products Regulatory Authority (HPRA), prior to being placed on the market in Ireland
ga: Go ginearálta, ní mór táirgí a dhíoltar mar chógais nó mar tháirgí a bhfuil saintréithe cógais iontu a bheith faofa ag an Údarás Rialála Táirgí Sláinte sula gcuirtear iad ar an margadh in Éirinn

source: Some herbal medicines do not meet the usual criteria for medicine authorisation and for this reason the European Union introduced separate rules for Traditional Herbal Medicines
ga: Ní chomhlíonann roinnt cógais luibhe na gnáthchritéir le haghaidh údarú cógais agus is mar thoradh air sin a thug an tAontas Eorpach rialacha ar leith le haghaidh Cógais Luibhe Thraidisiúnta isteach

source: The European Traditional Herbal Medicinal Products Directive (2004/24/EC) (pdf) came into effect in Ireland on 23rd July 2007 by Statutory Instrument No
ga: Tháinig an Treoir Eorpach maidir le Táirgí Míochaine Luibhe Traidisiúnta (2004/24/CE) in éifeacht in Éirinn an 23 Iúil 2007 le hIonstraim Reachtúil Uimh

source: The Directive establishes a regulatory approval process for herbal medicines in the EU
ga: Leis an Treoir, bunaítear próiseas údarú rialála le haghaidh cógais luibhe san AE

source: It allows for a simplified registration procedure for traditional herbal medicines that have been used for at least 30 years, including at least 15 years within the EU, and that are for use without medical supervision and without injection
ga: Éascaíonn sí nós imeachta simplithe clárúcháin le haghaidh cógais luibhe thraidisiúnta a úsáideadh le 30 bliain anuas ar a laghad, lena n-áirítear 15 bliana ar a laghad laistigh den AE, agus atá le húsáid gan cúram leighis agus gan instealladh

source: You can read more information about herbal medicines on the Health Products Regulatory Authority website where you can also search the list of authorised herbal medicines
ga: Is féidir tuilleadh faisnéise faoi chógais luibhe a léamh ar láithreán Gréasáin an Údaráis Rialála Táirgí Sláinte mar ar féidir an liosta de chógais luibhe údaraithe a chuardach freisin
